src/Documents/ИТСервисы_Задача/ИТСервисы_Задача.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_Задача</name>
  <registerRecords>InformationRegister.ИТСервисы_СостоянияЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_НагрузкаСотрудникаПоЗадачам</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Задачи</name>
    <attributes>
      <name>UUIDСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИТСервис</name>
      <type>
        <types>CatalogRef.ИТСервисы_ИТСервисы</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Приоритет</name>
      <type>
        <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяТрудоемкость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическаяТрудоемкость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenID</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>KaitenCardURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененПослеСинхронизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейСинхронизации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийСтатус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_СостоянияЗадач/ИТСервисы_СостоянияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_СостоянияЗадач</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </resources>
  <resources>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>KaitenID</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешнийСтатус</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>KaitenCardURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзмененПослеСинхронизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейСинхронизации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>UUIDСтроки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/ИТСервисы_НагрузкаСотрудникаПоЗадачам/ИТСервисы_НагрузкаСотрудникаПоЗадачам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_НагрузкаСотрудникаПоЗадачам</name>
  <resources>
    <name>ПланЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФактЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/AccumulationRegisters/ИТСервисы_ДвижениеРесурсовСервисов/ИТСервисы_ДвижениеРесурсовСервисов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИТСервисы_ДвижениеРесурсовСервисов</name>
  <resources>
    <name>ПроцентЗанятости</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИТСервис</name>
    <type>
      <types>CatalogRef.ИТСервисы_ИТСервисы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ИТСервисы_СтатусыЗадач/ИТСервисы_СтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыЗадач</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>Завершена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ИТСервисы_ПриоритетыЗадач/ИТСервисы_ПриоритетыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_ПриоритетыЗадач</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Критический</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_Задача/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ЭтоСлужебнаяЗапись = Ложь;

	Если ДополнительныеСвойства.Свойство("ЭтоСлужебнаяЗаписьИнтеграции", ЭтоСлужебнаяЗапись)
		И ЭтоСлужебнаяЗапись Тогда
		Возврат;
	КонецЕсли;

	ПодготовитьСтрокиКЗаписи();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.ИТСервисы_СостоянияЗадач.Записывать = Истина;
	Движения.ИТСервисы_СостоянияЗадач.Очистить();

	Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Записывать = Истина;
	Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Очистить();

	Для Каждого СтрокаЗадачи Из Задачи Цикл

		Запись = Движения.ИТСервисы_СостоянияЗадач.Добавить();
		Запись.Период = Дата;
		Запись.UUIDСтроки = Строка(СтрокаЗадачи.UUIDСтроки);
		Запись.Статус = СтрокаЗадачи.Статус;
		Запись.ПлановаяТрудоемкость = СтрокаЗадачи.ПлановаяТрудоемкость;
		Запись.ФактическаяТрудоемкость = СтрокаЗадачи.ФактическаяТрудоемкость;
		Запись.ИТСервис = СтрокаЗадачи.ИТСервис;
		Запись.Исполнитель = СтрокаЗадачи.Исполнитель;
		Запись.Приоритет = СтрокаЗадачи.Приоритет;
		Запись.KaitenID = СтрокаЗадачи.KaitenID;
		Запись.ВнешнийСтатус = СтрокаЗадачи.ВнешнийСтатус;
		Запись.KaitenCardURL = СтрокаЗадачи.KaitenCardURL;
		Запись.ДатаНачала = СтрокаЗадачи.ДатаНачала;
		Запись.ДатаОкончания = СтрокаЗадачи.ДатаОкончания;
		Запись.ИзмененПослеСинхронизации = СтрокаЗадачи.ИзмененПослеСинхронизации;
		Запись.ДатаПоследнейСинхронизации = СтрокаЗадачи.ДатаПоследнейСинхронизации;

		МесячноеРаспределение = ПолучитьРаспределениеЧасовПоМесяцам(
			СтрокаЗадачи.ДатаНачала,
			СтрокаЗадачи.ДатаОкончания,
			СтрокаЗадачи.ПлановаяТрудоемкость
		);

		Для Каждого СтрокаМесяца Из МесячноеРаспределение Цикл

			ЗаписьНагрузки = Движения.ИТСервисы_НагрузкаСотрудникаПоЗадачам.Добавить();
			ЗаписьНагрузки.ВидДвижения = ВидДвиженияНакопления.Приход;
			ЗаписьНагрузки.Период = СтрокаМесяца.Период;
			ЗаписьНагрузки.ИТСервис = СтрокаЗадачи.ИТСервис;
			ЗаписьНагрузки.Исполнитель = СтрокаЗадачи.Исполнитель;
			ЗаписьНагрузки.ПланЧасов = СтрокаМесяца.Часы;
			ЗаписьНагрузки.ФактЧасов = 0;

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры


Процедура ПроверитьЗаполнениеСтрок(Отказ)

	Если Задачи.Количество() = 0 Тогда
		Сообщить("Документ не содержит строк задач.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ДатаПроверкиНазначений = ПолучитьМаксимальнуюДатуПроверки();
	НазначенияСотрудников = ПолучитьНазначенияСотрудниковНаСервисы(ДатаПроверкиНазначений);
	ПотребностьПоМесяцам = СформироватьПотребностьПоНагрузке();
	ДоступныеЧасы = ПолучитьДоступныеЧасыПакетно(ПотребностьПоМесяцам);
	УжеНазначенныеЧасы = ПолучитьУжеНазначенныеЧасыПакетно(ПотребностьПоМесяцам);

	Для Каждого СтрокаЗадачи Из Задачи Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.ИТСервис) Тогда
			Сообщить("Не заполнен ИТ-сервис в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.Исполнитель) Тогда
			Сообщить("Не заполнен исполнитель в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.Описание) Тогда
			Сообщить("Не заполнено описание в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.ДатаНачала) Тогда
			Сообщить("Не заполнена дата начала в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.ДатаОкончания) Тогда
			Сообщить("Не заполнена дата окончания в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если СтрокаЗадачи.ДатаОкончания < СтрокаЗадачи.ДатаНачала Тогда
			Сообщить("Дата окончания меньше даты начала в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаЗадачи.ПлановаяТрудоемкость)
			И СтрокаЗадачи.ПлановаяТрудоемкость < 0 Тогда
			Сообщить("Плановая трудоёмкость не может быть отрицательной в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаЗадачи.ФактическаяТрудоемкость)
			И СтрокаЗадачи.ФактическаяТрудоемкость < 0 Тогда
			Сообщить("Фактическая трудоёмкость не может быть отрицательной в строке " + Строка(СтрокаЗадачи.НомерСтроки) + ".");
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		КлючНазначения = ПолучитьКлючНазначения(
			СтрокаЗадачи.ИТСервис,
			СтрокаЗадачи.Исполнитель
		);

		Если НазначенияСотрудников.Получить(КлючНазначения) = Неопределено Тогда
			Сообщить(
				"Сотрудник не назначен на выбранный ИТ-сервис в строке "
				+ Строка(СтрокаЗадачи.НомерСтроки) + "."
			);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

		ТекстОшибкиПерегрузки = ПроверитьПерегрузкуСотрудникаПоСтроке(
			СтрокаЗадачи,
			ПотребностьПоМесяцам,
			ДоступныеЧасы,
			УжеНазначенныеЧасы
		);

		Если НЕ ПустаяСтрока(ТекстОшибкиПерегрузки) Тогда
			Сообщить(ТекстОшибкиПерегрузки);
			Отказ = Истина;
			Возврат;
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры


Процедура ПодготовитьСтрокиКЗаписи()

	УникальныеUUID = Новый Соответствие;

	Для Каждого СтрокаЗадачи Из Задачи Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.UUIDСтроки) Тогда
			СтрокаЗадачи.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;

		Если УникальныеUUID.Получить(Строка(СтрокаЗадачи.UUIDСтроки)) <> Неопределено Тогда
			СтрокаЗадачи.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
		КонецЕсли;

		УникальныеUUID.Вставить(Строка(СтрокаЗадачи.UUIDСтроки), Истина);

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.Статус) Тогда
			СтрокаЗадачи.Статус = Перечисления.ИТСервисы_СтатусыЗадач.Новая;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтрокаЗадачи.Приоритет) Тогда
			СтрокаЗадачи.Приоритет = Перечисления.ИТСервисы_ПриоритетыЗадач.Средний;
		КонецЕсли;

		СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;

	КонецЦикла;

КонецПроцедуры


Функция ПолучитьКлючНазначения(ИТСервис, Исполнитель) Экспорт

	Возврат Строка(ИТСервис) + "|" + Строка(Исполнитель);

КонецФункции


Функция ПолучитьКлючНагрузки(ИТСервис, Исполнитель, Период) Экспорт

	Возврат Строка(ИТСервис) + "|" + Строка(Исполнитель) + "|" + Формат(Период, "ДФ='yyyyMMdd'");

КонецФункции


Функция ПолучитьМаксимальнуюДатуПроверки() Экспорт

	МаксимальнаяДата = Дата;

	Для Каждого СтрокаЗадачи Из Задачи Цикл
		Если ЗначениеЗаполнено(СтрокаЗадачи.ДатаОкончания) Тогда
			Если СтрокаЗадачи.ДатаОкончания > МаксимальнаяДата Тогда
				МаксимальнаяДата = СтрокаЗадачи.ДатаОкончания;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат МаксимальнаяДата;

КонецФункции


Функция ПолучитьНазначенияСотрудниковНаСервисы(ДатаПроверки) Экспорт

	Результат = Новый Соответствие;

	МассивСервисов = Новый Массив;
	МассивСотрудников = Новый Массив;

	Для Каждого СтрокаЗадачи Из Задачи Цикл

		Если ЗначениеЗаполнено(СтрокаЗадачи.ИТСервис) Тогда
			Если МассивСервисов.Найти(СтрокаЗадачи.ИТСервис) = Неопределено Тогда
				МассивСервисов.Добавить(СтрокаЗадачи.ИТСервис);
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаЗадачи.Исполнитель) Тогда
			Если МассивСотрудников.Найти(СтрокаЗадачи.Исполнитель) = Неопределено Тогда
				МассивСотрудников.Добавить(СтрокаЗадачи.Исполнитель);
			КонецЕсли;
		КонецЕсли;

	КонецЦикла;

	Если МассивСервисов.Количество() = 0 Или МассивСотрудников.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Остатки.ИТСервис КАК ИТСервис,
	|	Остатки.Сотрудник КАК Сотрудник,
	|	Остатки.ПроцентЗанятостиОстаток КАК ПроцентЗанятостиОстаток,
	|	Остатки.ЧасовВМесяцОстаток КАК ЧасовВМесяцОстаток
	|ИЗ
	|	РегистрНакопления.ИТСервисы_ДвижениеРесурсовСервисов.Остатки(
	|		&ДатаПроверки,
	|		ИТСервис В (&МассивСервисов)
	|			И Сотрудник В (&МассивСотрудников)
	|	) КАК Остатки";

	Запрос.УстановитьПараметр("ДатаПроверки", КонецДня(ДатаПроверки));
	Запрос.УстановитьПараметр("МассивСервисов", МассивСервисов);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Выборка.ПроцентЗанятостиОстаток > 0
			Или Выборка.ЧасовВМесяцОстаток > 0 Тогда

			Ключ = ПолучитьКлючНазначения(Выборка.ИТСервис, Выборка.Сотрудник);
			Результат.Вставить(Ключ, Истина);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции


Функция ПолучитьРаспределениеЧасовПоМесяцам(ДатаНачала, ДатаОкончания, ПлановаяТрудоемкость) Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("Часы");

	Если НЕ ЗначениеЗаполнено(ДатаНачала) Тогда
		ДатаНачала = Дата;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		ДатаОкончания = ДатаНачала;
	КонецЕсли;

	Если ДатаОкончания < ДатаНачала Тогда
		Возврат Таблица;
	КонецЕсли;

	КоличествоМесяцев = 0;
	ТекущаяДата = НачалоМесяца(ДатаНачала);

	Пока ТекущаяДата <= НачалоМесяца(ДатаОкончания) Цикл
		КоличествоМесяцев = КоличествоМесяцев + 1;
		ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);
	КонецЦикла;

	Если КоличествоМесяцев = 0 Тогда
		Возврат Таблица;
	КонецЕсли;

	ЧасыНаМесяц = Окр(ПлановаяТрудоемкость / КоличествоМесяцев, 2);
	ОстатокЧасов = ПлановаяТрудоемкость;

	ТекущаяДата = НачалоМесяца(ДатаНачала);
	НомерМесяца = 0;

	Пока ТекущаяДата <= НачалоМесяца(ДатаОкончания) Цикл

		НомерМесяца = НомерМесяца + 1;
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.Период = ТекущаяДата;

		Если НомерМесяца < КоличествоМесяцев Тогда
			НоваяСтрока.Часы = ЧасыНаМесяц;
			ОстатокЧасов = ОстатокЧасов - ЧасыНаМесяц;
		Иначе
			НоваяСтрока.Часы = ОстатокЧасов;
		КонецЕсли;

		ТекущаяДата = ДобавитьМесяц(ТекущаяДата, 1);

	КонецЦикла;

	Возврат Таблица;

КонецФункции



Функция СформироватьПотребностьПоНагрузке() Экспорт

	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИТСервис");
	Таблица.Колонки.Добавить("Исполнитель");
	Таблица.Колонки.Добавить("Период");
	Таблица.Колонки.Добавить("Часы");
	Таблица.Колонки.Добавить("UUIDСтроки");

	Для Каждого СтрокаЗадачи Из Задачи Цикл

		Распределение = ПолучитьРаспределениеЧасовПоМесяцам(
			СтрокаЗадачи.ДатаНачала,
			СтрокаЗадачи.ДатаОкончания,
			СтрокаЗадачи.ПлановаяТрудоемкость
		);

		Для Каждого СтрокаМесяца Из Распределение Цикл
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.ИТСервис = СтрокаЗадачи.ИТСервис;
			НоваяСтрока.Исполнитель = СтрокаЗадачи.Исполнитель;
			НоваяСтрока.Период = СтрокаМесяца.Период;
			НоваяСтрока.Часы = СтрокаМесяца.Часы;
			НоваяСтрока.UUIDСтроки = СтрокаЗадачи.UUIDСтроки;
		КонецЦикла;

	КонецЦикла;

	Возврат Таблица;

КонецФункции

Функция ПолучитьДоступныеЧасыПакетно(ПотребностьПоМесяцам) Экспорт

	Результат = Новый Соответствие;
	МассивСервисов = Новый Массив;
	МассивСотрудников = Новый Массив;

	Если ПотребностьПоМесяцам.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	МинимальныйПериод = Неопределено;
	МаксимальныйПериод = Неопределено;

	Для Каждого СтрокаПотребности Из ПотребностьПоМесяцам Цикл

		Если МассивСервисов.Найти(СтрокаПотребности.ИТСервис) = Неопределено Тогда
			МассивСервисов.Добавить(СтрокаПотребности.ИТСервис);
		КонецЕсли;

		Если МассивСотрудников.Найти(СтрокаПотребности.Исполнитель) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаПотребности.Исполнитель);
		КонецЕсли;

		Если МинимальныйПериод = Неопределено Или СтрокаПотребности.Период < МинимальныйПериод Тогда
			МинимальныйПериод = СтрокаПотребности.Период;
		КонецЕсли;

		Если МаксимальныйПериод = Неопределено Или СтрокаПотребности.Период > МаксимальныйПериод Тогда
			МаксимальныйПериод = СтрокаПотребности.Период;
		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОстаткиИОбороты.ИТСервис КАК ИТСервис,
	|	ОстаткиИОбороты.Сотрудник КАК Исполнитель,
	|	НАЧАЛОПЕРИОДА(ОстаткиИОбороты.Период, МЕСЯЦ) КАК Период,
	|	ОстаткиИОбороты.ЧасовВМесяцКонечныйОстаток КАК ДоступноЧасов
	|ИЗ
	|	РегистрНакопления.ИТСервисы_ДвижениеРесурсовСервисов.ОстаткиИОбороты(
	|		&ДатаНачала,
	|		&ДатаОкончания,
	|		Месяц,
	|		,
	|		ИТСервис В (&МассивСервисов)
	|			И Сотрудник В (&МассивСотрудников)
	|	) КАК ОстаткиИОбороты";

	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(МинимальныйПериод));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(МаксимальныйПериод));
	Запрос.УстановитьПараметр("МассивСервисов", МассивСервисов);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Ключ = ПолучитьКлючНагрузки(
			Выборка.ИТСервис,
			Выборка.Исполнитель,
			НачалоМесяца(Выборка.Период)
		);
		Результат.Вставить(Ключ, Выборка.ДоступноЧасов);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьУжеНазначенныеЧасыПакетно(ПотребностьПоМесяцам) Экспорт

	Результат = Новый Соответствие;
	МассивСервисов = Новый Массив;
	МассивСотрудников = Новый Массив;

	Если ПотребностьПоМесяцам.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого СтрокаПотребности Из ПотребностьПоМесяцам Цикл

		Если МассивСервисов.Найти(СтрокаПотребности.ИТСервис) = Неопределено Тогда
			МассивСервисов.Добавить(СтрокаПотребности.ИТСервис);
		КонецЕсли;

		Если МассивСотрудников.Найти(СтрокаПотребности.Исполнитель) = Неопределено Тогда
			МассивСотрудников.Добавить(СтрокаПотребности.Исполнитель);
		КонецЕсли;

	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Нагрузка.ИТСервис КАК ИТСервис,
	|	Нагрузка.Исполнитель КАК Исполнитель,
	|	НАЧАЛОПЕРИОДА(Нагрузка.Период, МЕСЯЦ) КАК Период,
	|	СУММА(Нагрузка.ПланЧасов) КАК УжеНазначено
	|ИЗ
	|	РегистрНакопления.ИТСервисы_НагрузкаСотрудникаПоЗадачам КАК Нагрузка
	|ГДЕ
	|	Нагрузка.ИТСервис В (&МассивСервисов)
	|	И Нагрузка.Исполнитель В (&МассивСотрудников)
	|	И Нагрузка.Регистратор <> &Регистратор
	|
	|СГРУППИРОВАТЬ ПО
	|	Нагрузка.ИТСервис,
	|	Нагрузка.Исполнитель,
	|	НАЧАЛОПЕРИОДА(Нагрузка.Период, МЕСЯЦ)";

	Запрос.УстановитьПараметр("МассивСервисов", МассивСервисов);
	Запрос.УстановитьПараметр("МассивСотрудников", МассивСотрудников);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Ключ = ПолучитьКлючНагрузки(Выборка.ИТСервис, Выборка.Исполнитель, Выборка.Период);
		Результат.Вставить(Ключ, Выборка.УжеНазначено);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПроверитьПерегрузкуСотрудникаПоСтроке(СтрокаЗадачи, ПотребностьПоМесяцам, ДоступныеЧасы, УжеНазначенныеЧасы) Экспорт

	Распределение = ПолучитьРаспределениеЧасовПоМесяцам(
		СтрокаЗадачи.ДатаНачала,
		СтрокаЗадачи.ДатаОкончания,
		СтрокаЗадачи.ПлановаяТрудоемкость
	);

	Для Каждого СтрокаМесяца Из Распределение Цикл

		Ключ = ПолучитьКлючНагрузки(
			СтрокаЗадачи.ИТСервис,
			СтрокаЗадачи.Исполнитель,
			СтрокаМесяца.Период
		);

		Доступно = ДоступныеЧасы.Получить(Ключ);
		Если Доступно = Неопределено Тогда
			Доступно = 0;
		КонецЕсли;

		УжеНазначено = УжеНазначенныеЧасы.Получить(Ключ);
		Если УжеНазначено = Неопределено Тогда
			УжеНазначено = 0;
		КонецЕсли;

		Если ТипЗнч(Доступно) = Тип("Null") Тогда
			Доступно = 0;
		КонецЕсли;

		Если ТипЗнч(УжеНазначено) = Тип("Null") Тогда
			УжеНазначено = 0;
		КонецЕсли;

		ОстатокДоступныхЧасов = Доступно - УжеНазначено;
		Если ОстатокДоступныхЧасов < 0 Тогда
			ОстатокДоступныхЧасов = 0;
		КонецЕсли;

		Если СтрокаМесяца.Часы > ОстатокДоступныхЧасов Тогда
			Возврат
				"Перегрузка сотрудника в строке " + Строка(СтрокаЗадачи.НомерСтроки)
				+ ". За период "
				+ Формат(СтрокаМесяца.Период, "ДФ='MM.yyyy'")
				+ " доступно ещё "
				+ Строка(Окр(ОстатокДоступныхЧасов, 2))
				+ " ч.";
		КонецЕсли;

	КонецЦикла;

	Возврат "";

КонецФункции

Функция ПолучитьУникальныеПериодыПотребности(ПотребностьПоМесяцам) Экспорт

	МассивПериодов = Новый Массив;

	Для Каждого СтрокаПотребности Из ПотребностьПоМесяцам Цикл
		Если МассивПериодов.Найти(СтрокаПотребности.Период) = Неопределено Тогда
			МассивПериодов.Добавить(СтрокаПотребности.Период);
		КонецЕсли;
	КонецЦикла;

	Возврат МассивПериодов;

КонецФункции
